export default function AboutPage() {
  return (
    <>
      <h2>Про сайт Vitrino</h2>
      <p className="paragraph">Мета створення: потреба в інтернет-вітрині з картками товарів, де процес перегляду та купівлі товарів дуже швидкий та зручний. Сайт дозволятиме переглядати картки товарів, обирати потрібні товари та робити замовлення.</p>
      <p className="paragraph">Загальна функціональність: у поточній версії застосунок відображає картки товарів з назвою, ціною, категорією та кнопкою «Додати в кошик». При натисканні на кнопку «Додати в кошик» товар візуально змінюється, а кнопка перейменовується на «Скасувати», що дозволяє прибрати продукт із кошику. На сторінці є форма фільтрації товарів, що дозволяє переглянути лише товари в певній категорії. При натисканні на кнопку «Зробити замовлення» всі елементи повертаються до стану за замовчуванням, що імітує процес завершення замовлення. На сторінці є форма додавання нового товару. Для додавання товару достатньо вказати його назву, категорію та ціну. Реалізовано базову валідацію форми додавання нового товару, щоб уникнути пустих назв товарів, пустих назв категорій та від’ємних цін. Товари зберігаються у LocalStorage браузера, тому після перезавантаження сторінки зберігаються як новостворені товари, так і їх стан. На сторінці також є блок із картками товарів, які завантажені з використанням API, але ці картки не функціонують і не фільтруються — вони лише презентують використання API на сайті.</p>
      <p className="paragraph">На разі на сайті створено декілька сторінок, а навігацію між ними реалізовано з використанням бібліотеки React Router.</p>
    </>
  );
}